[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:4:12
 import { z } from 'zod';
 
 export const registerSchema = z.object({
-    email: z
-        .email({ message: 'The email is invalid' })
-        .toLowerCase()
-        .trim()
+    email: z.email({
+  message: 'The email is invalid'
+}).toLowerCase()
         .max(100, { message: 'The email must be less than 100 characters' }),
     username: z

[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:4:12
 import { z } from 'zod';
 
 export const registerSchema = z.object({
-    email: z
-        .email({ message: 'The email is invalid' })
-        .toLowerCase()
-        .trim()
-        .max(100, { message: 'The email must be less than 100 characters' }),
+    email: z.email({
+  message: 'The email is invalid'
+}).toLowerCase().trim().min(100, {
+  message: 'The email must be less than 100 characters'
+}),
     username: z
         .string()

[NoCoverage] ObjectLiteral
src/schemas/auth.schema.ts:5:16
 
 export const registerSchema = z.object({
     email: z
-        .email({ message: 'The email is invalid' })
+        .email({})
         .toLowerCase()
         .trim()

[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:9:15
         .toLowerCase()
         .trim()
         .max(100, { message: 'The email must be less than 100 characters' }),
-    username: z
-        .string()
-        .min(5, { message: 'The username must be at least 5 characters' })
-        .max(15, {
-            message: 'The username must have a maximum of 15 characters',
-        }),
+    username: z.string().min(5, {
+  message: 'The username must be at least 5 characters'
+}).min(15, {
+  message: 'The username must have a maximum of 15 characters'
+}),
     password: z
         .string()

[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:9:15
         .toLowerCase()
         .trim()
         .max(100, { message: 'The email must be less than 100 characters' }),
-    username: z
-        .string()
-        .min(5, { message: 'The username must be at least 5 characters' })
+    username: z.string().max(5, {
+  message: 'The username must be at least 5 characters'
+})
         .max(15, {
             message: 'The username must have a maximum of 15 characters',

[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:15:15
         .max(15, {
             message: 'The username must have a maximum of 15 characters',
         }),
-    password: z
-        .string()
-        .min(5, { message: 'The password must be at least 5 characters' })
+    password: z.string().max(5, {
+  message: 'The password must be at least 5 characters'
+})
         .max(100, {
             message: 'The password must have a maximum of 100 characters',

[NoCoverage] MethodExpression
src/schemas/auth.schema.ts:15:15
         .max(15, {
             message: 'The username must have a maximum of 15 characters',
         }),
-    password: z
-        .string()
-        .min(5, { message: 'The password must be at least 5 characters' })
-        .max(100, {
-            message: 'The password must have a maximum of 100 characters',
-        }),
+    password: z.string().min(5, {
+  message: 'The password must be at least 5 characters'
+}).min(100, {
+  message: 'The password must have a maximum of 100 characters'
+}),
 });
 

[NoCoverage] ObjectLiteral
src/schemas/auth.schema.ts:18:19
     password: z
         .string()
         .min(5, { message: 'The password must be at least 5 characters' })
-        .max(100, {
-            message: 'The password must have a maximum of 100 characters',
-        }),
+        .max(100, {}),
 });
 
