[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:21:17
     _next: NextFunction
 ) => {
     // Log to console for dev
-    console.log(err.stack?.red || err);
+    console.log(true);
 
     let statusCode = 500;

[NoCoverage] OptionalChaining
src/middlewares/error.old.ts:21:17
     _next: NextFunction
 ) => {
     // Log to console for dev
-    console.log(err.stack?.red || err);
+    console.log(err.stack.red || err);
 
     let statusCode = 500;

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:26:9
     let statusCode = 500;
     let message = 'Server Error';
 
-    if (err instanceof ErrorResponse) {
+    if (false) {
         statusCode = err.statusCode;
         message = err.message;

[NoCoverage] BlockStatement
src/middlewares/error.old.ts:26:39
     let statusCode = 500;
     let message = 'Server Error';
 
-    if (err instanceof ErrorResponse) {
-        statusCode = err.statusCode;
-        message = err.message;
-    }
+    if (err instanceof ErrorResponse) {}
     // Vérifie si l'erreur vient d'openapi validator (présence de status ou d'errors)
     else if (err.status || err.errors) {

[NoCoverage] BlockStatement
src/middlewares/error.old.ts:31:40
         message = err.message;
     }
     // Vérifie si l'erreur vient d'openapi validator (présence de status ou d'errors)
-    else if (err.status || err.errors) {
-        statusCode = err.status || 400;
-
-        // Sécurisation avec le chaînage optionnel ?.
-        const firstError = err.errors?.[0];
-
-        if (firstError) {
-            const cleanPath = firstError.path.startsWith('/')
-                ? firstError.path.slice(1)
-                : firstError.path;
-            message = `${cleanPath}: ${firstError.message}`;
-        } else {
-            message = err.message || 'Validation Error';
-        }
-    }
+    else if (err.status || err.errors) {}
     // Pour toutes les autres erreurs (ex: plantage de la base de données)
     else {

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:31:14
         message = err.message;
     }
     // Vérifie si l'erreur vient d'openapi validator (présence de status ou d'errors)
-    else if (err.status || err.errors) {
+    else if (false) {
         statusCode = err.status || 400;
 

[NoCoverage] LogicalOperator
src/middlewares/error.old.ts:32:22
     }
     // Vérifie si l'erreur vient d'openapi validator (présence de status ou d'errors)
     else if (err.status || err.errors) {
-        statusCode = err.status || 400;
+        statusCode = err.status && 400;
 
         // Sécurisation avec le chaînage optionnel ?.

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:32:22
     }
     // Vérifie si l'erreur vient d'openapi validator (présence de status ou d'errors)
     else if (err.status || err.errors) {
-        statusCode = err.status || 400;
+        statusCode = false;
 
         // Sécurisation avec le chaînage optionnel ?.

[NoCoverage] OptionalChaining
src/middlewares/error.old.ts:35:28
         statusCode = err.status || 400;
 
         // Sécurisation avec le chaînage optionnel ?.
-        const firstError = err.errors?.[0];
+        const firstError = err.errors[0];
 
         if (firstError) {

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:37:13
         // Sécurisation avec le chaînage optionnel ?.
         const firstError = err.errors?.[0];
 
-        if (firstError) {
+        if (true) {
             const cleanPath = firstError.path.startsWith('/')
                 ? firstError.path.slice(1)

[NoCoverage] BlockStatement
src/middlewares/error.old.ts:37:25
         // Sécurisation avec le chaînage optionnel ?.
         const firstError = err.errors?.[0];
 
-        if (firstError) {
-            const cleanPath = firstError.path.startsWith('/')
-                ? firstError.path.slice(1)
-                : firstError.path;
-            message = `${cleanPath}: ${firstError.message}`;
-        } else {
+        if (firstError) {} else {
             message = err.message || 'Validation Error';
         }

[NoCoverage] MethodExpression
src/middlewares/error.old.ts:38:31
         const firstError = err.errors?.[0];
 
         if (firstError) {
-            const cleanPath = firstError.path.startsWith('/')
+            const cleanPath = firstError.path.endsWith('/')
                 ? firstError.path.slice(1)
                 : firstError.path;

[NoCoverage] MethodExpression
src/middlewares/error.old.ts:39:19
 
         if (firstError) {
             const cleanPath = firstError.path.startsWith('/')
-                ? firstError.path.slice(1)
+                ? firstError.path
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;

[NoCoverage] BlockStatement
src/middlewares/error.old.ts:42:16
                 ? firstError.path.slice(1)
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
-        } else {
-            message = err.message || 'Validation Error';
-        }
+        } else {}
     }
     // Pour toutes les autres erreurs (ex: plantage de la base de données)

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:43:23
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
         } else {
-            message = err.message || 'Validation Error';
+            message = false;
         }
     }

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:43:23
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
         } else {
-            message = err.message || 'Validation Error';
+            message = true;
         }
     }

[NoCoverage] BlockStatement
src/middlewares/error.old.ts:47:10
         }
     }
     // Pour toutes les autres erreurs (ex: plantage de la base de données)
-    else {
-        message = err.message || 'Server Error';
-    }
+    else {}
 
     res.status(statusCode).json({

[NoCoverage] LogicalOperator
src/middlewares/error.old.ts:48:19
     }
     // Pour toutes les autres erreurs (ex: plantage de la base de données)
     else {
-        message = err.message || 'Server Error';
+        message = err.message && 'Server Error';
     }
 

[NoCoverage] ConditionalExpression
src/middlewares/error.old.ts:48:19
     }
     // Pour toutes les autres erreurs (ex: plantage de la base de données)
     else {
-        message = err.message || 'Server Error';
+        message = false;
     }
 

[NoCoverage] BooleanLiteral
src/middlewares/error.old.ts:52:18
     }
 
     res.status(statusCode).json({
-        success: false,
+        success: true,
         error: message,
     });
