[Killed] BlockStatement
src/controllers/auth.ts:14:6
     req: Request,
     res: Response,
     next: NextFunction
-) => {
-    const request = req.body as RegisterBody;
-    const username = request.username;
-    const email = request.email;
-    const password = request.password;
-
-    const factor = 12;
-    const passwordHash = await bcrypt.hash(password, factor);
-
-    try {
-        const user: UserRecord = await createUser(
-            email,
-            username,
-            passwordHash
-        );
-        res.status(201).json({ user });
-    } catch (err) {
-        if (err instanceof Error && 'code' in err && err.code === '23505') {
-            next(new ErrorResponse('Account already exists', 409));
-            return;
-        }
-        next(err);
-    }
-};
+) => {};
 
killedBy: Register Route should return a status code 201 with success
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Number of calls: 0

[Killed] BlockStatement
src/controllers/auth.ts:23:9
     const factor = 12;
     const passwordHash = await bcrypt.hash(password, factor);
 
-    try {
-        const user: UserRecord = await createUser(
-            email,
-            username,
-            passwordHash
-        );
-        res.status(201).json({ user });
-    } catch (err) {
+    try {} catch (err) {
         if (err instanceof Error && 'code' in err && err.code === '23505') {
             next(new ErrorResponse('Account already exists', 409));
killedBy: Register Route should return a status code 201 with success
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Number of calls: 0

[Survived] ObjectLiteral
src/controllers/auth.ts:29:30
             username,
             passwordHash
         );
-        res.status(201).json({ user });
+        res.status(201).json({});
     } catch (err) {
         if (err instanceof Error && 'code' in err && err.code === '23505') {

[Killed] BlockStatement
src/controllers/auth.ts:30:19
             passwordHash
         );
         res.status(201).json({ user });
-    } catch (err) {
-        if (err instanceof Error && 'code' in err && err.code === '23505') {
-            next(new ErrorResponse('Account already exists', 409));
-            return;
-        }
-        next(err);
-    }
+    } catch (err) {}
 };
 
killedBy: Register Route should return a status code 409 with Error (duplication)
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] EqualityOperator
src/controllers/auth.ts:31:54
         );
         res.status(201).json({ user });
     } catch (err) {
-        if (err instanceof Error && 'code' in err && err.code === '23505') {
+        if (err instanceof Error && 'code' in err && err.code !== '23505') {
             next(new ErrorResponse('Account already exists', 409));
             return;
killedBy: Register Route should return a status code 409 with Error (duplication)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/controllers/auth.ts:31:76
         );
         res.status(201).json({ user });
     } catch (err) {
-        if (err instanceof Error && 'code' in err && err.code === '23505') {
-            next(new ErrorResponse('Account already exists', 409));
-            return;
-        }
+        if (err instanceof Error && 'code' in err && err.code === '23505') {}
         next(err);
     }
killedBy: Register Route should return a status code 409 with Error (duplication)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
