[NoCoverage] StringLiteral
src/middlewares/error.ts:21:19
     _next: NextFunction
 ) => {
     let statusCode = 500;
-    let message = 'Server Error';
+    let message = "";
 
     if (err instanceof ErrorResponse) {

[NoCoverage] ConditionalExpression
src/middlewares/error.ts:23:9
     let statusCode = 500;
     let message = 'Server Error';
 
-    if (err instanceof ErrorResponse) {
+    if (true) {
         statusCode = err.statusCode;
         message = err.message;

[NoCoverage] LogicalOperator
src/middlewares/error.ts:29:9
     }
     // Error express-openapi-Validator
     else if (
-        err &&
-        typeof err === 'object' &&
-        'name' in err &&
-        'status' in err &&
-        'errors' in err
+        err && typeof err === 'object' && 'name' in err && 'status' in err || 'errors' in err
     ) {
         const openApiErr = err as OpenApiValidator;

[NoCoverage] LogicalOperator
src/middlewares/error.ts:29:9
     }
     // Error express-openapi-Validator
     else if (
-        err &&
-        typeof err === 'object' &&
+        err || typeof err === 'object' &&
         'name' in err &&
         'status' in err &&

[NoCoverage] ConditionalExpression
src/middlewares/error.ts:30:9
     // Error express-openapi-Validator
     else if (
         err &&
-        typeof err === 'object' &&
+        true &&
         'name' in err &&
         'status' in err &&

[NoCoverage] EqualityOperator
src/middlewares/error.ts:30:9
     // Error express-openapi-Validator
     else if (
         err &&
-        typeof err === 'object' &&
+        typeof err !== 'object' &&
         'name' in err &&
         'status' in err &&

[NoCoverage] StringLiteral
src/middlewares/error.ts:32:9
         err &&
         typeof err === 'object' &&
         'name' in err &&
-        'status' in err &&
+        "" in err &&
         'errors' in err
     ) {

[NoCoverage] BlockStatement
src/middlewares/error.ts:34:7
         'name' in err &&
         'status' in err &&
         'errors' in err
-    ) {
-        const openApiErr = err as OpenApiValidator;
-        statusCode = openApiErr.status;
-
-        // Sécurisation avec le chaînage optionnel ?.
-        const firstError = openApiErr.errors[0];
-
-        if (firstError) {
-            const cleanPath = firstError.path.startsWith('/')
-                ? firstError.path.slice(1)
-                : firstError.path;
-            message = `${cleanPath}: ${firstError.message}`;
-        } else {
-            message = openApiErr.message || 'Validation Error';
-        }
-    }
+    ) {}
     // Others Errors
     else {

[NoCoverage] ConditionalExpression
src/middlewares/error.ts:41:13
         // Sécurisation avec le chaînage optionnel ?.
         const firstError = openApiErr.errors[0];
 
-        if (firstError) {
+        if (false) {
             const cleanPath = firstError.path.startsWith('/')
                 ? firstError.path.slice(1)

[NoCoverage] BlockStatement
src/middlewares/error.ts:46:16
                 ? firstError.path.slice(1)
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
-        } else {
-            message = openApiErr.message || 'Validation Error';
-        }
+        } else {}
     }
     // Others Errors

[NoCoverage] LogicalOperator
src/middlewares/error.ts:47:23
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
         } else {
-            message = openApiErr.message || 'Validation Error';
+            message = openApiErr.message && 'Validation Error';
         }
     }

[NoCoverage] ConditionalExpression
src/middlewares/error.ts:47:23
                 : firstError.path;
             message = `${cleanPath}: ${firstError.message}`;
         } else {
-            message = openApiErr.message || 'Validation Error';
+            message = false;
         }
     }

[NoCoverage] BlockStatement
src/middlewares/error.ts:51:10
         }
     }
     // Others Errors
-    else {
-        if (err instanceof Error) {
-            console.error('Server Error', err.stack);
-        } else {
-            console.error('Server Error (Unknown Type):', err);
-        }
-    }
+    else {}
 
     res.status(statusCode).json({

[NoCoverage] ConditionalExpression
src/middlewares/error.ts:52:13
     }
     // Others Errors
     else {
-        if (err instanceof Error) {
+        if (false) {
             console.error('Server Error', err.stack);
         } else {

[NoCoverage] BlockStatement
src/middlewares/error.ts:52:35
     }
     // Others Errors
     else {
-        if (err instanceof Error) {
-            console.error('Server Error', err.stack);
-        } else {
+        if (err instanceof Error) {} else {
             console.error('Server Error (Unknown Type):', err);
         }

[NoCoverage] BlockStatement
src/middlewares/error.ts:54:16
     else {
         if (err instanceof Error) {
             console.error('Server Error', err.stack);
-        } else {
-            console.error('Server Error (Unknown Type):', err);
-        }
+        } else {}
     }
 
