[Killed] BlockStatement
src/models/user.model.ts:9:27
     email: string,
     username: string,
     password_hash: string
-): Promise<UserRecord> => {
-    const result = await pool.query<UserRecord>(
-        `INSERT INTO users (email, username, password_hash)
-         VALUES ($1, $2, $3)
-         RETURNING id, email, username, role`,
-        [email, username, password_hash]
-    );
-    const user = result.rows[0];
-    if (!user) throw new ErrorResponse('User creation failed', 400);
-    return user;
-};
+): Promise<UserRecord> => {};
 
killedBy: createUser should insert a user and return the created user data
statusReason: expected undefined to deeply equal { id: 1, …(3) }

[Killed] StringLiteral
src/models/user.model.ts:11:9
     password_hash: string
 ): Promise<UserRecord> => {
     const result = await pool.query<UserRecord>(
-        `INSERT INTO users (email, username, password_hash)
-         VALUES ($1, $2, $3)
-         RETURNING id, email, username, role`,
+        ``,
         [email, username, password_hash]
     );
killedBy: createUser should insert a user and return the created user data
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] ArrayDeclaration
src/models/user.model.ts:14:9
         `INSERT INTO users (email, username, password_hash)
          VALUES ($1, $2, $3)
          RETURNING id, email, username, role`,
-        [email, username, password_hash]
+        []
     );
     const user = result.rows[0];
killedBy: createUser should insert a user and return the created user data
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "INSERT INTO users",

[Killed] BooleanLiteral
src/models/user.model.ts:17:9
         [email, username, password_hash]
     );
     const user = result.rows[0];
-    if (!user) throw new ErrorResponse('User creation failed', 400);
+    if (user) throw new ErrorResponse('User creation failed', 400);
     return user;
 };
killedBy: createUser should insert a user and return the created user data
statusReason: User creation failed

[Killed] ConditionalExpression
src/models/user.model.ts:17:9
         [email, username, password_hash]
     );
     const user = result.rows[0];
-    if (!user) throw new ErrorResponse('User creation failed', 400);
+    if (true) throw new ErrorResponse('User creation failed', 400);
     return user;
 };
killedBy: createUser should insert a user and return the created user data
statusReason: User creation failed
