[Killed] BlockStatement
src/utils/errorResponse.ts:3:54
 class ErrorResponse extends Error {
     statusCode: number;
-    constructor(message: string, statusCode: number) {
-        super(message);
-        this.statusCode = statusCode;
-
-        // Keep the stack trace
-        Object.setPrototypeOf(this, new.target.prototype);
-    }
+    constructor(message: string, statusCode: number) {}
 }
 
killedBy: Register Route should return a status code 409 with Error (duplication)
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
