[Survived] ObjectLiteral
src/config/db.ts:4:15
 import pg from 'pg';
 import dotenv from 'dotenv';
 
-dotenv.config({ path: './config/development.env' });
+dotenv.config({});
 
 const pool = new pg.Pool({
